CassiniSea/lcd-st7735-stm8s/main.c
void UI_DrawGraph(void) {
	uint8_t i;
	VerticalGuidePosition_TypeDef verticalGuidePosition = getVerticalGuidePosition();
	
	ST7735_FillRect(
		2,
		0,
		1,
		UI_GRAPH_HEIGHT,
		ST7735_BLACK
	);	
	
	if(verticalGuidePosition.current != verticalGuidePosition.prev) {
		ST7735_FillRect(
			0,
			verticalGuidePosition.prev,
			SCREEN_WIDTH,
			1,
			ST7735_BLACK
		);
	}
	
	for(i = graphGuidePosition; i < UI_GRAPH_WIDTH - 1; i += UI_GRAPH_GUIDE_INTERVAL) {
		ST7735_FillRect(
			UI_GRAPH_WIDTH - i + 1,
			0,
			1,
			UI_GRAPH_HEIGHT,
			ST7735_BLACK
		);
		ST7735_FillRect(
			UI_GRAPH_WIDTH - i,
			0,
			1,
			UI_GRAPH_HEIGHT,
			UI_GRAPH_GUIDE_COLOR
		);
	}
	
	ST7735_FillRect(
		0,
		verticalGuidePosition.current,
		SCREEN_WIDTH,
		1,
		UI_GRAPH_GUIDE_COLOR
	);
	
	for(i = 0; i < UI_GRAPH_WIDTH - 2; i++) {
		drawGraphSegment(graphPowerValues, i, UI_GRAPH_HEATER_POWER_COLOR);
		drawGraphSegment(graphTemperatureValues, i, ST7735_RED);
	}
	
	UI_DrawNumber(
		40,
		SCREEN_HEIGHT - 3 * (FONT_HEIGHT + 3),
		(uint16_t)temperature,
		ST7735_GREEN,
		UI_PANEL_COLOR
	);
}

float getHeaterTemperature(void) {
	float rTherm = THERM_R2/(THERM_ADC_MAX/(float)ADC_READ - 1);
	
	if(ADC_READ > 950)
		return 25.0f;

	return (THERM_BETA * (THERM_0K + 25))/(THERM_BETA + (THERM_0K + 25) * log(rTherm / THERM_R_25K)) - THERM_0K;		
}

void updateVariable(uint8_t variableNumber, uint16_t value) {
	variablesValues[variableNumber] = value;
	if(variablesSettings[variableNumber].onUpdate)
		variablesSettings[variableNumber].onUpdate(value);
}

uint8_t getButtonsState(void) {
    uint8_t state = 0;

    if (!GPIO_READ_INPUT_PIN(GPIOC, GPIO_PIN_3))
      state |= EVENT_BUTTON_1_PRESSED;
				
		if (!GPIO_READ_INPUT_PIN(GPIOC, GPIO_PIN_7))
      state |= EVENT_BUTTON_2_PRESSED;

		if (!GPIO_READ_INPUT_PIN(GPIOA, GPIO_PIN_1))
      state |= EVENT_BUTTON_3_PRESSED;
			
		if (!GPIO_READ_INPUT_PIN(GPIOA, GPIO_PIN_2))
			state |= EVENT_BUTTON_4_PRESSED;

    return state;
}

void button1Routine(void) {
	uint16_t increment;
	
	if(ui_mode == UI_MODE_SELECT) {
		if(selected_variable > 0)
			selected_variable -= 1;
		else 
			selected_variable = VARIABLES_NUMBER - 1;
	}
	else if(ui_mode == UI_MODE_EDIT) {
    switch (selected_digit) {
			case 0: increment = 10000; break;
			case 1: increment = 1000;  break;
			case 2: increment = 100;   break;
			case 3: increment = 10;    break;
			default: increment = 1;    break;
    }
		
		if (variablesValues[selected_variable] > (variablesSettings[selected_variable].maxValue - increment)) {
			updateVariable(selected_variable, variablesSettings[selected_variable].maxValue);
		} else {
			updateVariable(selected_variable, variablesValues[selected_variable] + increment);
		}
		
		UI_DrawVariables();
	}
		
	UI_DrawMarker();
}

void button2Routine(void) {
	uint16_t decrement;
	
	if(ui_mode == UI_MODE_SELECT) {
		if(selected_variable < VARIABLES_NUMBER - 1)
			selected_variable += 1;
		else 
			selected_variable = 0;
	}
	else if(ui_mode == UI_MODE_EDIT) {
    switch (selected_digit) {
			case 0: decrement = 10000; break;
			case 1: decrement = 1000;  break;
			case 2: decrement = 100;   break;
			case 3: decrement = 10;    break;
			default: decrement = 1;    break;
    }
		
		if (decrement > variablesValues[selected_variable] - variablesSettings[selected_variable].minValue) {
			updateVariable(selected_variable, variablesSettings[selected_variable].minValue);
		} else {
			updateVariable(selected_variable, variablesValues[selected_variable] - decrement);
		}
		
		UI_DrawVariables();
	}
		
	UI_DrawMarker();
}

void button3Routine(void) {
	if(selected_digit == 0) {
		ui_mode = UI_MODE_SELECT;
		eepromWriteU16(selected_variable, variablesValues[selected_variable]);
	}	else
		selected_digit--;
	
	UI_DrawMarker();
}

void button4Routine(void) {
	if(ui_mode == UI_MODE_SELECT)
		ui_mode = UI_MODE_EDIT;
	else if(ui_mode == UI_MODE_EDIT) {		
		if(selected_digit < VARIABLE_MAX_DIGITS - 1)
			selected_digit++;
		else {
			updateVariable(selected_variable, eepromReadU16(selected_variable, 0));
			UI_DrawVariables();
		}
	}
	
	UI_DrawMarker();
}

void graphUpdate(void) {
	graphPushValue(graphScaledTemperatureValue(temperature), graphScaledPowerValue(getHeaterPwmFiltered()));
	UI_DrawGraph();	
}

void heaterUpdate(void) {
	static float pid_prev_error = 0.0f;
	static float pid_integral = 0.0f;
	float error, p_term, d_term, output;
	float kp = (float)variablesValues[VARIABLE_KP];
	float ki = (float)variablesValues[VARIABLE_KI];
	float kd = (float)variablesValues[VARIABLE_KD];
	
	temperature = getHeaterTemperature();
	if(temperature > variablesSettings[VARIABLE_TEMP].maxValue + 10) {
		programEvent |= EVENT_HEATER_ERROR;
		TIM4_Cmd(DISABLE);
	}		
	if(temperature >= variablesValues[VARIABLE_TEMP])
		variablesSettings[VARIABLE_SPD].onUpdate(variablesValues[VARIABLE_SPD]);
	
	// Считаем ошибку		
	error = (float)variablesValues[VARIABLE_TEMP] - temperature;
	
	// Пропорциональная составляющая
	p_term = kp * error;
	
	// Интегральная составляющая
	//pid_integral += ki * error;		
	if (error < 10.0f && error > -10.0f) {
			// Интегратор работает только в пределах +-10 градусов от цели
			pid_integral += ki * error; 
	} 
	else {
			// Пока мы далеко от цели, сбрасываем интегратор, чтобы он не копил мусор
			pid_integral = 0.0f; 
	}
	// Анти-виндэп (Anti-windup): ограничиваем интеграл, чтобы он не "разгонялся"
	if (pid_integral > HEATER_PWM_PERIOD_MAX * 0.6f) pid_integral = HEATER_PWM_PERIOD_MAX * 0.6f;
	else if (pid_integral < 0.0f) pid_integral = 0.0f;
	
	// Дифференциальная составляющая
	d_term = kd * (error - pid_prev_error);
	pid_prev_error = error;
	
	// Суммируем выходное значение
	output = p_term + pid_integral + d_term;
	
	// Ограничиваем выход под рамки ARR таймера (0 - 1250)
	heaterPwm = 0;
	if (output >= (float)HEATER_PWM_PERIOD_MAX) {
			heaterPwm = HEATER_PWM_PERIOD_MAX + 1;
	} else if (output <= 0.0f) {
			heaterPwm = 0;
	} else {
			heaterPwm = (uint16_t)output;
	}
	
	if(programEvent & EVENT_HEATER_ERROR) {
		heaterPwm = 0;
	}
	
	// Обновляем ШИМ нагревателя
	TIM2_SET_COMPARE1(heaterPwm);
	updateHeaterPwmFiltered(heaterPwm);
}

