CassiniSea/lcd-st7735-stm8s/main.c
main() {
	CLK_INIT_16MHZ();
	ITC_SET_PRIORITY(ITC->ISPR3, ISPR3_V11_TIM1_OVF_L1);
	
	ST7735_Init();
	ST7735_SetRotation(1);
	
	GPIO_INIT_OUTPUT(MOTOR_PORT, MOTOR_PIN);	
	
	EXTI_SET_SENSITIVITY(EXTI_A_FALL_ONLY | EXTI_C_FALL_ONLY);
	GPIO_INIT_INPUT_PULLUP(GPIOA, GPIO_PIN_1 | GPIO_PIN_2);
	GPIO_IT_ENABLE(GPIOA, GPIO_PIN_1 | GPIO_PIN_2);
	GPIO_INIT_INPUT_PULLUP(GPIOC, GPIO_PIN_3 | GPIO_PIN_7);
	GPIO_IT_ENABLE(GPIOC, GPIO_PIN_3 | GPIO_PIN_7);

	TIM4_TimeBaseInit(TIM4_PRESCALER_128, TIM4_ARR(MOTOR_SPEED_SLOW));
	TIM4_ITConfig(TIM4_IT_UPDATE, ENABLE);
	TIM4_Cmd(ENABLE);
	
	ADC_INIT_CONTINUOUS(ADC_CH_2, ADC_PRESSEL_FCPU_D4);
	
	TIM1_TimeBaseInit(16, TIM1_COUNTERMODE_UP, (1000000 / TIM1_FREQUENCY) - 1, 0);
	TIM1_ITConfig(TIM1_IT_UPDATE, ENABLE);
	
	TIM2_INIT(TIM2_PRESCALER_16384, HEATER_PWM_PERIOD_MAX, TIM2_PWM_CH1, TIM2_INT_DISABLE);
	
	enableInterrupts();
	
	ST7735_FillRect(
		0,
		0,
		SCREEN_WIDTH,
		SCREEN_HEIGHT - UI_PANEL_HEIGHT,
		ST7735_BLACK
	);
	
	ST7735_FillRect(
    0,
    SCREEN_HEIGHT - UI_PANEL_HEIGHT,
    SCREEN_WIDTH,
    UI_PANEL_HEIGHT,
    UI_PANEL_COLOR
	);
	
	variablesInit();
	
	UI_DrawVariables();
	UI_DrawMarker();	

	TIM1_Cmd(ENABLE);
	TIM2_ENABLE();
	
	while (1) {
		uint16_t heaterMarkerColor = UI_PANEL_COLOR;
		
		if(programEvent & EVENT_BUTTON_1_PRESSED) {
			button1Routine();
			programEvent &= ~EVENT_BUTTON_1_PRESSED;
		}
		
		if(programEvent & EVENT_BUTTON_2_PRESSED) {
			button2Routine();
			programEvent &= ~EVENT_BUTTON_2_PRESSED;
		}
		
		if(programEvent & EVENT_BUTTON_3_PRESSED) {
			button3Routine();
			programEvent &= ~EVENT_BUTTON_3_PRESSED;
		}
		
		if(programEvent & EVENT_BUTTON_4_PRESSED) {
			button4Routine();
			programEvent &= ~EVENT_BUTTON_4_PRESSED;
		}
		
		if(programEvent & EVENT_GRAPH_UPDATE) {
			graphUpdate();
			programEvent &= ~EVENT_GRAPH_UPDATE;
		}
		
		if(programEvent & EVENT_HEATER_UPDATE) {
			heaterUpdate();
			programEvent &= ~EVENT_HEATER_UPDATE;
		}
		
		if(!GPIO_READ_INPUT_PIN(GPIOD, GPIO_PIN_4))
			heaterMarkerColor = ST7735_RED;

		ST7735_FillRect(
			10,
			SCREEN_HEIGHT - 3 * (FONT_HEIGHT + 3),
			FONT_HEIGHT,
			FONT_HEIGHT,
			heaterMarkerColor
		);
		
		if(programEvent & EVENT_HEATER_ERROR) {
			UI_DrawText(
				65,
				UI_GRAPH_HEIGHT / 2,
				label_ERROR,
				5,
				ST7735_WHITE,
				ST7735_RED
			);
		}
	}

}

@far @interrupt void tim1UpdateInterrupt(void) {	
	if (buttonsDebounce) {
    buttonsDebounce--;

    if (buttonsDebounce == 0) {
			programEvent |= getButtonsState();
    }
	}	
	
	heaterDelay++;
	if(heaterDelay > HEATER_UPDATE_DELAY_TIM1) {
		heaterDelay = 0;		
		programEvent |= EVENT_HEATER_UPDATE;
	}
	
	graphDelay++;
	if(graphDelay > GRAPH_UPDATE_DELAY_TIM1) {
		graphDelay = 0;
		programEvent |= EVENT_GRAPH_UPDATE;
	}
	
	TIM1_ClearITPendingBit(TIM1_IT_UPDATE);
}

@far @interrupt void tim4UpdateInterrupt(void) {
	TIM4_ClearITPendingBit(TIM1_IT_UPDATE);
	
	GPIO_WRITE_REVERCE(MOTOR_PORT, MOTOR_PIN);
}

@far @interrupt void gpioaExtiInterrupt(void) {
	buttonsDebounce = BUTTONS_DEBOUNCE_LIMIT;
}

@far @interrupt void gpiocExtiInterrupt(void) {	
	buttonsDebounce = BUTTONS_DEBOUNCE_LIMIT;
}